# -*-coding: utf-8-*-
#+TITLE: Spitting out shell with Perl 6
#+EMAIL: lloyd.fourn@gmail.com
#+AUTHOR: Lloyd Fournier

#+BEGIN_SRC emacs-lisp :tangle yes
(setq org-export-coding-system 'utf-8)
(setq org-confirm-babel-evaluate nil)
(load "~/docs/spit-sydneypm/ob-spit.el")
#+END_SRC

*** Spec tests

#+BEGIN_SRC spit
  given File("$*HOME/src/spitsh/spec") {
      my $n-tests = 0;
      my @files;

      for .find(name => /\.t$/) {
          .slurp ~~ /plan (\d+)/;
          $n-tests += @/[1]-->Int;
          @files.push("@/[1] $_");
      }

      say @files.numeric-sort;
      say "TOTAL: $n-tests";
  }
#+END_SRC

#+RESULTS:
#+BEGIN_src shell
BEGIN(){
  list(){ printf "%s\n" "$*"; }
  e(){ printf %s "$1"; }
  IFS='
'
  f_find(){ find "$1" $(test "$name" && list -name "$name"); }
  M=''
  subst(){
    e "$1"|
    T="$2" R="$3" awk -v "g=$g" '
        BEGIN { RS="^$"; r=ENVIRON["R"]; t=ENVIRON["T"] }
        {
          while( (g || !i) && (i = index($0,t)) )
          $0 = substr($0,1,i-1) r substr($0,i + length(t));
          print;
        }'
  }
  matches(){
    RE_1="$(subst "$2" \# '\#')"
    e "$1"|sed -nr "H;1h;\$!d;x;\#$RE_1#!q1"
  }
  exec 4>/dev/null
  match(){
    M=''
    if matches "$1" "$2"; then
      RE="$(subst "$2" \# '\#')"
      M="$(i=0; while e "$1"|sed -nr "H;1h;\$!d;x;s#$RE#👻\\$i\n🐚#;s/.*👻|🐚.*//gp" 2>&4; do
        : $((i+=1))
      done)"
    else
      false
    fi
  }
  at_pos(){ e "$1"|sed -n "$(($2+1))p"|tr -d '\n'; }
  push(){ e "$1"|awk -v "item=$2" '{ print } END { print item }'; }
  exec 3>&1
  say(){ printf '%s\n' "$1" >&3; }

}
MAIN(){
  _1="$HOME/src/spitsh/spec"; {
    n_tests=0
    files=''
    for _2 in $(name='*.t' f_find "$_1"); do
      match "$(cat "$_2")" 'plan ([0-9]+)'
      n_tests=$((n_tests+$(at_pos "$M" 1)))
      files=$(push "$files" "$(at_pos "$M" 1) $_2")
    done
    say "$(e "$files"|sort -n)"
    say "TOTAL: $n_tests"
  }
}
BEGIN && MAIN
#+END_src

#+RESULTS:
|      1 | /home/llfourn/src/spitsh/spec/base/pattern.t             |
|      1 | /home/llfourn/src/spitsh/spec/base/syntax.t              |
|      2 | /home/llfourn/src/spitsh/spec/base/concat.t              |
|      2 | /home/llfourn/src/spitsh/spec/base/int.t                 |
|      2 | /home/llfourn/src/spitsh/spec/base/is-impure.t           |
|      2 | /home/llfourn/src/spitsh/spec/base/sanity.t              |
|      3 | /home/llfourn/src/spitsh/spec/base/method-rw.t           |
|      3 | /home/llfourn/src/spitsh/spec/base/on-block.t            |
|      3 | /home/llfourn/src/spitsh/spec/base/opts.t                |
|      3 | /home/llfourn/src/spitsh/spec/packages/git.t             |
|      4 | /home/llfourn/src/spitsh/spec/base/docs.t                |
|      4 | /home/llfourn/src/spitsh/spec/base/git.t                 |
|      4 | /home/llfourn/src/spitsh/spec/packages/curl.t            |
|      5 | /home/llfourn/src/spitsh/spec/base/constant.t            |
|      6 | /home/llfourn/src/spitsh/spec/base/export.t              |
|      6 | /home/llfourn/src/spitsh/spec/base/PID.t                 |
|     10 | /home/llfourn/src/spitsh/spec/base/scalar-assignment.t   |
|     15 | /home/llfourn/src/spitsh/spec/base/class.t               |
|     16 | /home/llfourn/src/spitsh/spec/base/FD.t                  |
|     17 | /home/llfourn/src/spitsh/spec/base/ternary.t             |
|     19 | /home/llfourn/src/spitsh/spec/base/enum-class.t          |
|     19 | /home/llfourn/src/spitsh/spec/base/parameterized-class.t |
|     20 | /home/llfourn/src/spitsh/spec/base/given-when.t          |
|     24 | /home/llfourn/src/spitsh/spec/base/quote.t               |
|     24 | /home/llfourn/src/spitsh/spec/base/while.t               |
|     25 | /home/llfourn/src/spitsh/spec/base/cmd.t                 |
|     29 | /home/llfourn/src/spitsh/spec/base/file.t                |
|     30 | /home/llfourn/src/spitsh/spec/base/int-expr.t            |
|     31 | /home/llfourn/src/spitsh/spec/base/sub.t                 |
|     35 | /home/llfourn/src/spitsh/spec/base/str.t                 |
|     36 | /home/llfourn/src/spitsh/spec/base/for.t                 |
|     37 | /home/llfourn/src/spitsh/spec/base/regex.t               |
|     41 | /home/llfourn/src/spitsh/spec/base/list.t                |
|     46 | /home/llfourn/src/spitsh/spec/base/if.t                  |
|    138 | /home/llfourn/src/spitsh/spec/base/junctions.t           |
| TOTAL: | 663                                                      |

